/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Qualsiasi data]@";
"%@ %[Today]@" = "%1$@ %2$[Oggi]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Ieri]@";
"%@ %[This week]@" = "%1$@ %2$[Questa settimana]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[Nelle ultime due settimane]@";
"%@ %[This month]@" = "%1$@ %2$[Questo mese]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[Negli ultimi due mesi]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Qualsiasi]@";
"%@ %[Yes]@" = "%1$@ %2$[Sì]@";
"%@ %[No]@" = "%1$@ %2$[No]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Contiene]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Cominicia con]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Finisce con]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[È]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Esattamente il]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Prima del]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[Dopo il]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Maggiore di]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Minore di]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[Negli ultimi]@ %3$@ %4$[Giorni]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[Nelle ultime]@ %3$@ %4$[Settimane]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[Negli ultimi]@ %3$@ %4$[Mesi]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[Negli ultimi]@ %3$@ %4$[Anni]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Spazio colore]@ %2$[Qualsiasi spazio colore]@";
"%[Color Space]@ %[RGB]@" = "%1$[Spazio colore]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Spazio colore]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Spazio colore]@ %2$[Grigi]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Contenuto]@ contiene %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Durata]@ %2$[maggiore di]@ %3$@ %4$[min]@ %5$@ %6$[sec]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Durata]@ %2$[minore di]@ %3$@ %4$[min]@ %5$@ %6$[sec]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Parole chiave]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[parole chiave]@ contiene %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Tipo]@ è %2$[Qualsiasi]@";
"%[Kind]@ is %[Images]@" = "%1$[Tipo]@ è %2$[Immagini]@";
"%[Kind]@ is %[Text]@" = "%1$[Tipo]@ è %2$[Testo]@";
"%[Kind]@ is %[PDF]@" = "%1$[Tipo]@ è %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Tipo]@ è %2$[Filmati]@";
"%[Kind]@ is %[Music]@" = "%1$[Tipo]@ è %2$[Musica]@";
"%[Kind]@ is %[Documents]@" = "%1$[Tipo]@ è %2$[Documenti]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Tipo]@ è %2$[Presentazioni]@";
"%[Kind]@ is %[Folders]@" = "%1$[Tipo]@ è %2$[Cartelle]@";
"%[Kind]@ is %[Applications]@" = "%1$[Tipo]@ è %2$[Applicazioni]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Tipo]@ e %2$[Altri...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Etichetta]@ è %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Aperto]@ %2$[Qualsiasi data]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Modificato]@ %2$[Qualsiasi data]@";
"%[Created]@ %[Any Date]@" = "%1$[Creato]@ %2$[Qualsiasi data]@";
"%[Last Opened]@ %[Today]@" = "%1$[Aperto]@ %2$[Oggi]@";
"%[Last Modified]@ %[Today]@" = "%1$[Modificato]@ %2$[Oggi]@";
"%[Created]@ %[Today]@" = "%1$[Creato]@ %2$[Oggi]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Aperto]@ %2$[Da ieri]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Modificato]@ %2$[Da ieri]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Creato]@ %2$[Da ieri]@";
"%[Last Opened]@ %[This week]@" = "%1$[Aperto]@ %2$[Questa settimana]@";
"%[Last Modified]@ %[This week]@" = "%1$[Modificato]@ %2$[Questa settimana]@";
"%[Created]@ %[This week]@" = "%1$[Creato]@ %2$[Questa settimana]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Aperto]@ %2$[Nelle ultime due settimane]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Modificato]@ %2$[Nelle ultime due settimane]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Creato]@ %2$[Nelle ultime due settimane]@";
"%[Last Opened]@ %[This month]@" = "%1$[Aperto]@ %2$[Questo mese]@";
"%[Last Modified]@ %[This month]@" = "%1$[Modificato]@ %2$[Questo mese]@";
"%[Created]@ %[This month]@" = "%1$[Creato]@ %2$[Questo mese]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Aperto]@ %2$[Negli ultimi due mesi]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Modificato]@ %2$[Negli ultimi due mesi]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Creato]@ %2$[Negli ultimi due mesi]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Aperto]@ %2$[Esattamente il]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Modificato]@ %2$[Esattamente il]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Creato]@ %2$[Esattamente il]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Aperto]@ %2$[Dopo il]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Modificato]@ %2$[Prima del]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Creato]@ %2$[Prima del]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Aperto]@ %2$[Dopo il]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Modificato]@ %2$[Dopo il]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Creato]@ %2$[Dopo il]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Aperto]@ %2$[Negli ultimi]@ %3$@ %4$[Giorni]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Modificato]@ %2$[Negli ultimi]@ %3$@ %4$[Giorni]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Creato]@ %2$[Negli ultimi]@ %3$@ %4$[Giorni]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Aperto]@ %2$[Nelle ultime]@ %3$@ %4$[Settimane]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Modificato]@ %2$[Nelle ultime]@ %3$@ %4$[Settimane]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Creato]@ %2$[Nelle ultime]@ %3$@ %4$[Settimane]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Aperto]@ %2$[Negli ultimi]@ %3$@ %4$[Mesi]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Modificato]@ %2$[Negli ultimi]@ %3$@ %4$[Mesi]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Creato]@ %2$[Negli ultimi]@ %3$@ %4$[Mesi]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Aperto]@ %2$[Negli ultimi]@ %3$@ %4$[Anni]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Modificato]@ %2$[Negli ultimi]@ %3$@ %4$[Anni]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Creato]@ %2$[Negli ultimi]@ %3$@ %4$[Anni]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Genere musicale]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Estensione nome]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Nome]@ %2$[Contiene]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Nome]@ %2$[Inizia con]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Nome]@ %2$[Termina con]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Nome]@ %2$[È]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Orientamento]@ %2$[Qualsiasi orientamento]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Orientamento]@ %2$[Paesaggio]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Orientamento]@ %2$[Ritratto]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Altro...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Query semplice]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Cerca]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Dimensioni]@ %2$[Maggiori di]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Dimensioni]@ %2$[Minori di]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Dimensioni]@ %2$[Maggiori di]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Dimensioni]@ %2$[Minori di]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Dimensioni]@ %2$[Maggiori di]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Dimensioni]@ %2$[Minori di]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Visibilità]@ %2$[Visibile o invisibile]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Visibilità]@ %2$[Elementi visibili]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Visibilità]@ %2$[Elementi invisibili]@";

